module.exports = {
    name: "rules",
    description: "Displays the rules for the group chat",
    nashPrefix: false,
    version: "1.0.0",
    role: 0,
    cooldowns: 5,
    async execute(api, event, args) {
        const { threadID, messageID } = event;

        const rules = `
[ กฎกติกา ]\n\n
1. เคารพซึ่งกันและกัน: ปฏิบัติต่อทุกคนในกลุ่มด้วยความเมตตาและเคารพ
2. ห้ามส่งสแปม: หลีกเลี่ยงการส่งข้อความซ้ำๆ หรือไม่เกี่ยวข้อง
3. พูดคุยในหัวข้อที่เกี่ยวข้อง: คุยเฉพาะเรื่องที่เกี่ยวข้องกับวัตถุประสงค์ของกลุ่ม
4. ห้ามแชร์ข้อมูลส่วนตัว: อย่าแชร์ข้อมูลส่วนตัวของตัวเองหรือผู้อื่นโดยไม่ได้รับอนุญาต
5. ปฏิบัติตามจุดประสงค์ของกลุ่ม: ให้แน่ใจว่าข้อความของคุณสนับสนุนเป้าหมายการศึกษาหรือให้ข้อมูลของกลุ่ม
6. รายงานปัญหา: หากพบปัญหาหรือมีข้อกังวล ให้ติดต่อผู้ดูแลกลุ่ม
        `;

        api.sendMessage(rules, threadID, messageID);
    },
};